fio/results/libpmem_d32_cpuall_memdef_split.txt
libpmem-randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-randwrite: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-seqwrite: (g=2): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
libpmem-seqread: (g=3): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libpmem, iodepth=1
...
fio-3.6-5-gf31fe
Starting 128 processes
libpmem-randread: Laying out IO file (1 file / 256MiB)
libpmem-randread: Laying out IO file (1 file / 256MiB)
libpmem-randread: Laying out IO file (1 file / 256MiB)
[...]
libpmem-randwrite: Laying out IO file (1 file / 256MiB)
libpmem-randwrite: Laying out IO file (1 file / 256MiB)
libpmem-randwrite: Laying out IO file (1 file / 256MiB)
[...]
libpmem-seqwrite: Laying out IO file (1 file / 256MiB)
libpmem-seqwrite: Laying out IO file (1 file / 256MiB)
libpmem-seqwrite: Laying out IO file (1 file / 256MiB)
[...]
libpmem-seqread: Laying out IO file (1 file / 256MiB)
libpmem-seqread: Laying out IO file (1 file / 256MiB)
libpmem-seqread: Laying out IO file (1 file / 256MiB)
[...]
fio: ENOSPC on laying out file, stopping
libpmem-seqread: Laying out IO file (1 file / 256MiB)
fio: ENOSPC on laying out file, stopping
libpmem-seqread: Laying out IO file (1 file / 256MiB)
fio: ENOSPC on laying out file, stopping

libpmem-randread: (groupid=0, jobs=32): err= 0: pid=19758: Thu Apr 19 11:03:54 2018
   read: IOPS=8206k, BW=31.3GiB/s (33.6GB/s)(939GiB/30001msec)
    clat (nsec): min=99, max=4093.3k, avg=3485.89, stdev=2221.54
     lat (nsec): min=128, max=4093.3k, avg=3528.60, stdev=2225.72
    clat percentiles (nsec):
     |  1.00th=[ 1240],  5.00th=[ 1720], 10.00th=[ 2008], 20.00th=[ 2384],
     | 30.00th=[ 2672], 40.00th=[ 2960], 50.00th=[ 3216], 60.00th=[ 3536],
     | 70.00th=[ 3920], 80.00th=[ 4384], 90.00th=[ 5280], 95.00th=[ 6112],
     | 99.00th=[ 8096], 99.50th=[ 9152], 99.90th=[12352], 99.95th=[13760],
     | 99.99th=[16064]
   bw (  KiB/s): min=648623, max=1379081, per=3.02%, avg=990241.65, stdev=213966.33, samples=1888
   iops        : min=162155, max=344770, avg=247560.02, stdev=53491.56, samples=1888
  lat (nsec)   : 100=0.01%, 250=0.18%, 500=0.07%, 750=0.06%, 1000=0.13%
  lat (usec)   : 2=9.26%, 4=62.33%, 10=27.66%, 20=0.31%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=99.97%, sys=0.01%, ctx=1018, majf=0, minf=9647
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=246181824,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-randwrite: (groupid=1, jobs=32): err= 0: pid=19790: Thu Apr 19 11:03:54 2018
  write: IOPS=3854k, BW=14.7GiB/s (15.8GB/s)(441GiB/30002msec)
    clat (nsec): min=307, max=8044.5k, avg=5388.73, stdev=5937.77
     lat (nsec): min=337, max=8044.5k, avg=5432.39, stdev=5983.44
    clat percentiles (nsec):
     |  1.00th=[  318],  5.00th=[  442], 10.00th=[  772], 20.00th=[ 1384],
     | 30.00th=[ 1992], 40.00th=[ 2640], 50.00th=[ 3536], 60.00th=[ 5088],
     | 70.00th=[ 6240], 80.00th=[ 7648], 90.00th=[12096], 95.00th=[17792],
     | 99.00th=[27008], 99.50th=[30848], 99.90th=[38656], 99.95th=[41728],
     | 99.99th=[49408]
   bw (  KiB/s): min=139021, max=817910, per=2.13%, avg=328702.22, stdev=161859.19, samples=1888
   iops        : min=34755, max=204477, avg=82175.19, stdev=40464.81, samples=1888
  lat (nsec)   : 500=5.89%, 750=3.82%, 1000=3.92%
  lat (usec)   : 2=16.42%, 4=23.02%, 10=34.44%, 20=9.46%, 50=3.03%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 10=0.01%
  cpu          : usr=99.97%, sys=0.01%, ctx=1242, majf=0, minf=6017
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,115638612,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqwrite: (groupid=2, jobs=32): err= 0: pid=19822: Thu Apr 19 11:03:54 2018
  write: IOPS=3857k, BW=14.7GiB/s (15.8GB/s)(441GiB/30002msec)
    clat (nsec): min=307, max=4101.7k, avg=5386.74, stdev=5824.52
     lat (nsec): min=336, max=4101.7k, avg=5433.77, stdev=5834.88
    clat percentiles (nsec):
     |  1.00th=[  318],  5.00th=[  434], 10.00th=[  748], 20.00th=[ 1352],
     | 30.00th=[ 1944], 40.00th=[ 2576], 50.00th=[ 3408], 60.00th=[ 4960],
     | 70.00th=[ 6176], 80.00th=[ 7584], 90.00th=[12608], 95.00th=[18048],
     | 99.00th=[27776], 99.50th=[31616], 99.90th=[39680], 99.95th=[43264],
     | 99.99th=[50944]
   bw (  KiB/s): min=135353, max=821435, per=2.24%, avg=345085.46, stdev=174691.61, samples=1888
   iops        : min=33838, max=205358, avg=86270.98, stdev=43672.91, samples=1888
  lat (nsec)   : 500=6.07%, 750=3.95%, 1000=4.05%
  lat (usec)   : 2=16.79%, 4=23.42%, 10=32.92%, 20=9.45%, 50=3.33%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.01%, 10=0.01%
  cpu          : usr=99.98%, sys=0.01%, ctx=1123, majf=0, minf=6013
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,115719753,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
libpmem-seqread: (groupid=3, jobs=32): err= 0: pid=19854: Thu Apr 19 11:03:54 2018
   read: IOPS=12.7M, BW=48.5GiB/s (52.1GB/s)(1455GiB/30004msec)
    clat (nsec): min=99, max=8085.4k, avg=2163.09, stdev=2356.16
     lat (nsec): min=126, max=8085.5k, avg=2201.64, stdev=2370.24
    clat percentiles (nsec):
     |  1.00th=[  161],  5.00th=[  167], 10.00th=[  171], 20.00th=[  183],
     | 30.00th=[  438], 40.00th=[ 1784], 50.00th=[ 2224], 60.00th=[ 2608],
     | 70.00th=[ 2992], 80.00th=[ 3504], 90.00th=[ 4256], 95.00th=[ 5088],
     | 99.00th=[ 7008], 99.50th=[ 7968], 99.90th=[11200], 99.95th=[12736],
     | 99.99th=[15680]
   bw (  MiB/s): min=  338, max= 9109, per=3.13%, avg=1554.36, stdev=1606.54, samples=1906
   iops        : min=86530, max=2332126, avg=397916.24, stdev=411275.53, samples=1906
  lat (nsec)   : 100=0.01%, 250=25.42%, 500=5.22%, 750=1.58%, 1000=0.82%
  lat (usec)   : 2=11.32%, 4=42.95%, 10=12.52%, 20=0.16%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 10=0.01%
  cpu          : usr=99.81%, sys=0.16%, ctx=1197, majf=0, minf=391804
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=381330824,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=31.3GiB/s (33.6GB/s), 31.3GiB/s-31.3GiB/s (33.6GB/s-33.6GB/s), io=939GiB (1008GB), run=30001-30001msec

Run status group 1 (all jobs):
  WRITE: bw=14.7GiB/s (15.8GB/s), 14.7GiB/s-14.7GiB/s (15.8GB/s-15.8GB/s), io=441GiB (474GB), run=30002-30002msec

Run status group 2 (all jobs):
  WRITE: bw=14.7GiB/s (15.8GB/s), 14.7GiB/s-14.7GiB/s (15.8GB/s-15.8GB/s), io=441GiB (474GB), run=30002-30002msec

Run status group 3 (all jobs):
   READ: bw=48.5GiB/s (52.1GB/s), 48.5GiB/s-48.5GiB/s (52.1GB/s-52.1GB/s), io=1455GiB (1562GB), run=30004-30004msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%